'''
描述
根据邮件的重量和用户是否选择加急计算邮费。计算规则：重量在1000克以内(包括1000克), 基本费8元。超过1000克的部分，每500克加收超重费4元，不足500克部分按500克计算；如果用户选择加急，多收5元。

输入
输入一行，包含整数和一个字符，以一个空格分开，分别表示重量（单位为克）和是否加急。如果字符是y，说明选择加急；如果字符是n，说明不加急。
输出
输出一行，包含一个整数，表示邮费。
'''

s=list(input().split())
if s[-1]=='y':
    if eval(s[0])<=1000:
        fee=5+8
    elif eval(s[0])>1000 and (eval(s[0])-1000)%500 ==0:
        fee=5+8+4*((eval(s[0])-1000)//500)
    else:
        fee=5+8+4*((eval(s[0])-1000)//500+1)
else:
    if eval(s[0])<=1000:
        fee=8
    elif eval(s[0])>1000 and (eval(s[0])-1000)%500 ==0:
        fee=8+4*((eval(s[0])-1000)//500)
    else:
        fee=8+4*((eval(s[0])-1000)//500+1)
print(fee)
